/*
 *反幻方  我国古籍很早就记载着 
 *2 9 4
 *7 5 3
 *6 1 8 这是一个三阶幻方。每行每列以及对角线上的数字相加都相等。下面考虑一个相反的问题。可不可以用 1~9 的数字填入九宫格。使得：每行每列每个对角线上的数字和都互不相等呢？这应该能做到。
 *比如：9 1 2
 *    8 4 3
 *    7 5 6
 *你的任务是搜索所有的三阶反幻方。并统计出一共有多少种。旋转或镜像算同一种。比如：
 *9 1 2
 *8 4 3
 *7 5 6
 *
 *7 8 9
 *5 4 1
 *6 3 2
 *
 *2 1 9
 *3 4 8
 *6 5 7 等都算作同一种情况。
 */
package final_7;

public class Test_2 {
	static int count = 0;

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// char[] a="123456789".toCharArray();
		int[] a = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
		f(a, 0);
		System.out.println(count / 2 / 4);
	}

	public static void f(int[] a, int k) {
		if (k >= a.length) {
			if (check(a)) {
				count++;
			}
		}
		for (int i = k; i < a.length; i++) {
			// 试探
			{
				int temp = a[k];
				a[k] = a[i];
				a[i] = temp;
			}
			f(a, k + 1);
			// 回溯
			{
				int temp = a[k];
				a[k] = a[i];
				a[i] = temp;
			}
		}
	}

	//两两互不相等
	public static boolean check(int[] a) {
		if (a[0] + a[1] + a[2] != a[3] + a[4] + a[5] && a[0] + a[1] + a[2] != a[6] + a[7] + a[8]
				&& a[0] + a[1] + a[2] != a[0] + a[3] + a[6] && a[0] + a[1] + a[2] != a[1] + a[4] + a[7]
				&& a[0] + a[1] + a[2] != a[2] + a[5] + a[8] && a[0] + a[1] + a[2] != a[2] + a[4] + a[6]
				&& a[0] + a[1] + a[2] != a[0] + a[4] + a[8] && a[3] + a[4] + a[5] != a[6] + a[7] + a[8]
				&& a[3] + a[4] + a[5] != a[0] + a[3] + a[6] && a[3] + a[4] + a[5] != a[1] + a[4] + a[7]
				&& a[3] + a[4] + a[5] != a[2] + a[5] + a[8] && a[3] + a[4] + a[5] != a[2] + a[4] + a[6]
				&& a[3] + a[4] + a[5] != a[0] + a[4] + a[8] && a[6] + a[7] + a[8] != a[0] + a[3] + a[6]
				&& a[6] + a[7] + a[8] != a[1] + a[4] + a[7] && a[6] + a[7] + a[8] != a[2] + a[5] + a[8]
				&& a[6] + a[7] + a[8] != a[2] + a[4] + a[6] && a[6] + a[7] + a[8] != a[0] + a[4] + a[8]
				&& a[0] + a[3] + a[6] != a[1] + a[4] + a[7] && a[0] + a[3] + a[6] != a[2] + a[5] + a[8]
				&& a[0] + a[3] + a[6] != a[0] + a[4] + a[8] && a[0] + a[3] + a[6] != a[2] + a[4] + a[6]
				&& a[1] + a[4] + a[7] != a[2] + a[5] + a[8] && a[1] + a[4] + a[7] != a[0] + a[4] + a[8]
				&& a[1] + a[4] + a[7] != a[2] + a[4] + a[6] && a[2] + a[5] + a[8] != a[0] + a[4] + a[8]
				&& a[2] + a[5] + a[8] != a[2] + a[4] + a[6] && a[0] + a[4] + a[8] != a[2] + a[4] + a[6]) {
			return true;
		}
		return false;
	}
}
